[
    {
        "imgsrc": "/images/Engineering.jpg",
        "cardTitle": "Engineering",
        "cardDesc": "Our company offers comprehensive design, detailing and analysis (PENG) engineering services, specializing in design, development, and implementation across various industries. Create drawings using CAD software as per customer requirements. Welding: Our welding services provide high-quality solutions for a variety of industries, specializing in MIG, TIG, Stick, and flux-cored welding. We offer precise, durable welds for structural components, equipment repairs, and custom fabrications, working with materials like steel, aluminum, and stainless steel. With certified welders and advanced tools, we deliver efficient, cost-effective results, ensuring reliability and customer satisfaction on every project."
    },
    {
        "imgsrc": "/images/s3.jpg",
        "cardTitle": "Welding",
        "cardDesc": "Our welding services provide high-quality solutions for a variety of industries, specializing in MIG, TIG, Stick, and flux-cored welding. We offer precise, durable welds for structural components, equipment repairs, and custom fabrications, working with materials like steel, aluminum, and stainless steel. With certified welders and advanced tools, we deliver efficient, cost-effective results, ensuring reliability and customer satisfaction on every project."
    },
    {
        "imgsrc": "/images/s3.jpg",
        "cardTitle": "Machining",
        "cardDesc": "Our VMC (Vertical Machining Center) services specialize in high-precision machining for complex parts and components. Using state-of-the-art VMC technology, we offer advanced milling, drilling, and tapping capabilities with exceptional accuracy and surface finish. Ideal for producing intricate designs and tight tolerances, our VMC services are suitable for a wide range of materials, including metals, plastics, and composites. Whether it's for prototyping, custom orders, or large-scale production, our skilled operators ensure efficient, high-quality results tailored to your specific requirements."
    },
    {
        "imgsrc": "/images/s3.jpg",
        "cardTitle": "Sheet Metal Forming",
        "cardDesc": "Our sheet metal shear and forming services provide precise cutting and shaping of metal sheets to meet custom specifications. Using advanced shearing and forming equipment, we offer clean, accurate cuts and the ability to create complex shapes through processes like bending, punching, and rolling. Whether for small or large runs, our team ensures high-quality results, tailored to the unique needs of industries like construction, automotive, and manufacturing. We deliver efficient, cost-effective solutions with a focus on precision and durability."
    },
    {
        "imgsrc": "/images/s3.jpg",
        "cardTitle": "Painting",
        "cardDesc": "Our spray-painting services offer smooth, durable finishes for a range of materials, including metal, wood, and plastic. Using advanced equipment and high-quality coatings, we ensure precise, uniform coverage for both small and large projects. Whether for industrial, automotive, or custom applications, we deliver long-lasting results with attention to detail and efficiency."
    },
    {
        "imgsrc": "/images/s3.jpg",
        "cardTitle": "Shipping",
        "cardDesc": "Our shipping services provide reliable and efficient delivery within the Windsor and Tilbury region. We ensure timely, secure handling of your shipments, offering cost-effective solutions tailored to your needs. From packaging to delivery, our team guarantees safe and on-schedule service for all local freight."
    }
]